android-binder.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>android的binder机制</title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="title" content="android的binder机制"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2012-10-29 19:27:40 CST"/>
<meta name="author" content="Bao Haojun"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
<link rel="stylesheet" href="css/default.css" type="text/css">
 <link rel="shortcut icon" href="/poison.png" type="image/png" />


</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">android的binder机制</h1>

<p><code>status_t IPCThreadState::talkWithDriver(bool doReceive)</code> 这个函数会把kernel driver打交道，通过ioctl。
</p>
<p>
<code>status_t status = IPCThreadState::self()-&gt;transact(</code> 这个是在BpBinder
里的 <code>status_t BpBinder::transact(</code> 调用的。
</p>



<pre class="src src-c"><span class="org-preprocessor">#define</span> <span class="org-function-name">IMPLEMENT_META_INTERFACE</span>(<span class="org-variable-name">INTERFACE</span>, <span class="org-variable-name">NAME</span>)                       \
    <span class="org-keyword">const</span> <span class="org-type">android</span>::String16 I##INTERFACE::descriptor(NAME);             \
    <span class="org-keyword">const</span> <span class="org-type">android</span>::String16&amp;                                            \
            I##INTERFACE::getInterfaceDescriptor() <span class="org-keyword">const</span> {              \
        <span class="org-keyword">return</span> I##INTERFACE::descriptor;                                \
    }                                                                   \
    android::sp&lt;I##INTERFACE&gt; I##INTERFACE::asInterface(                \
            <span class="org-keyword">const</span> <span class="org-type">android</span>::sp&lt;android::IBinder&gt;&amp; obj)                   \
    {                                                                   \
        android::sp&lt;I##INTERFACE&gt; intr;                                 \
        <span class="org-keyword">if</span> (obj != <span class="org-constant">NULL</span>) {                                              \
            intr = static_cast&lt;I##INTERFACE*&gt;(                          \
                obj-&gt;queryLocalInterface(                               \
                        I##INTERFACE::descriptor).get());               \
            <span class="org-keyword">if</span> (intr == <span class="org-constant">NULL</span>) {                                         \
                intr = new Bp##INTERFACE(obj);                          \
            }                                                           \
        }                                                               \
        <span class="org-keyword">return</span> intr;                                                    \
    }                                                                   \
    I##INTERFACE::I##INTERFACE() { }                                    \
    I##INTERFACE::~I##INTERFACE() { }                                   \
</pre>


<p>
所有的BpXXX都是在这个 <code>I##INTERFACE::asInterface</code> 里创建的。
</p>
<p>
常见的用法是： 
</p>



<pre class="example">IBinder service = ServiceManager.getService("mount");
mMountService = IMountService.Stub.asInterface(service);
</pre>


<p>
与BpBinder类对应的是BBinder类，它们都是IBinder的子类，都需要定义
transact函数，不同是前者（proxy）的transact只是一个ipc调用，后者则是真
正干活的。
</p>
<p>
前者什么时候会被调用？随便一搜出来的基本上都是
<code>remote()-&gt;transact(...)</code> ，但后者的调用比较隐蔽一些，初步怀疑是在
<code>void IPCThreadState::joinThreadPool(bool isMain)</code> 里，调了 <code>result = talkWithDriver();</code> ，然后是 <code>result = executeCommand(cmd);</code> ，此函数会
调用 <code>const status_t error = b-&gt;transact(tr.code, buffer, &amp;reply, tr.flags);</code> 。
</p>
</div>

<div id="postamble">
    <hr/>
    <div style="float:left;width:160px;">
    <iframe width="100%" height="75" class="share_self"  frameborder="0" scrolling="no" src="http://widget.weibo.com/weiboshow/index.php?language=&width=0&height=550&fansRow=2&ptype=1&speed=0&skin=1&isTitle=0&noborder=0&isWeibo=0&isFans=0&uid=1611427581&verifier=936f3b91&dpc=1"></iframe>
    </div>
    <div id="jiathis_style_32x32" style="float:left;margin-left:20px;margin-top:35px;">
        <a class="jiathis_button_tsina"></a>
        <a class="jiathis_button_douban"></a>
        <a class="jiathis_button_tqq"></a>
        <a class="jiathis_button_renren"></a>
        <a class="jiathis_button_douban9dian"></a>
        <!--<a class="jiathis_button_readitlater"></a>-->
        <!--<a class="jiathis_button_instapaper"></a>-->
        <a href="http://www.jiathis.com/share" class="jiathis jiathis_txt jtico jtico_jiathis" target="_blank"></a>
        <!--<a class="jiathis_counter_style"></a>-->
    </div>
<script type="text/javascript">
    $(document).ready(function(){
        BYB.includeScript('http://v2.jiathis.com/code/jia.js',function(){})
    });
</script>


</div>
</body>
</html>
